Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_lsm303d.h
//*****************************************************************************
//
// hw_lsm303d.h - Macros used when accessing the ST LSM303D
//                accelerometer/magnetometer
//
// Copyright (c) 2013-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __SENSORLIB_HW_LSM303D_H__
#define __SENSORLIB_HW_LSM303D_H__

//*****************************************************************************
//
// The following are defines for the LSM303D register addresses
//
//*****************************************************************************
#define LSM303D_O_TEMP_OUT_LSB  0x5         // Temperature bits 7-0
#define LSM303D_O_TEMP_OUT_MSB  0x6         // Temperature bits 11-8
#define LSM303D_O_MAG_STATUS    0x7         // Magnetic status register
#define LSM303D_O_MAG_OUT_X_MSB 0x08        // X-axis MSB
#define LSM303D_O_MAG_OUT_X_LSB 0x09        // X-axis LSB
#define LSM303D_O_MAG_OUT_Y_MSB 0x0A        // Y-axis MSB
#define LSM303D_O_MAG_OUT_Y_LSB 0x0B        // Y-axis LSB
#define LSM303D_O_MAG_OUT_Z_MSB 0x0C        // Z-axis MSB
#define LSM303D_O_MAG_OUT_Z_LSB 0x0D        // Z-axis LSB
#define LSM303D_O_WHO_AM_I      0x0F        // ID register, constant 0x49
#define LSM303D_O_MAG_INT_CTRL  0x12        // magnetic control register
#define LSM303D_O_MAG_INT_SRC   0x13        // Interrupt source (status) for
                                            // magnetometer interrupt
#define LSM303D_O_MAG_THS_MSB   0x14        // Threshold MSB
#define LSM303D_O_MAG_THS_LSB   0x15        // Threshold LSB. Even though the
                                            // threshold is expressed in
                                            // absolute value, the device
                                            // detects both positive and
                                            // negative thresholds.
#define LSM303D_O_MAG_OFFSET_X_MSB                                            \
                                0x16        // MSB of Magnetic offset for
                                            // X-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_MAG_OFFSET_X_LSB                                            \
                                0x17        // LSB of Magnetic offset for
                                            // X-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_MAG_OFFSET_Y_MSB                                            \
                                0x18        // MSB of Magnetic offset for
                                            // Y-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_MAG_OFFSET_Y_LSB                                            \
                                0x19        // LSB of Magnetic offset for
                                            // Y-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_MAG_OFFSET_Z_MSB                                            \
                                0x1A        // MSB of Magnetic offset for
                                            // Z-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_MAG_OFFSET_Z_LSB                                            \
                                0x1B        // LSB of Magnetic offset for
                                            // Z-axis. The value is expressed
                                            // in 16-bit as 2s complement.
#define LSM303D_O_ACCEL_REFERENCE_X                                           \
                                0x1C        // Reference value for high-pass
                                            // filter for X-axis acceleration
                                            // data.
#define LSM303D_O_ACCEL_REFERENCE_Y                                           \
                                0x1D        // Reference value for high-pass
                                            // filter for Y-axis acceleration
                                            // data.
#define LSM303D_O_ACCEL_REFERENCE_Z                                           \
                                0x1E        // Reference value for high-pass
                                            // filter for Z-axis acceleration
                                            // data.
#define LSM303D_O_CTRL0         0x1F        // Accel control 0
#define LSM303D_O_CTRL1         0x20        // Control 1 - power settings
#define LSM303D_O_CTRL2         0x21        // Control 2
#define LSM303D_O_CTRL3         0x22        // Control 3
#define LSM303D_O_CTRL4         0x23        // Control 4
#define LSM303D_O_CTRL5         0x24        // Control 5
#define LSM303D_O_CTRL6         0x25        // Control 6
#define LSM303D_O_CTRL7         0x26        // Control 7
#define LSM303D_O_STATUS        0x27        // Status register
#define LSM303D_O_OUT_X_LSB     0x28        // X-axis LSB
#define LSM303D_O_OUT_X_MSB     0x29        // X-axis MSB
#define LSM303D_O_OUT_Y_LSB     0x2A        // Y-axis LSB
#define LSM303D_O_OUT_Y_MSB     0x2B        // Y-axis MSB
#define LSM303D_O_OUT_Z_LSB     0x2C        // Z-axis LSB
#define LSM303D_O_OUT_Z_MSB     0x2D        // Z-axis MSB
#define LSM303D_O_FIFO_CTRL     0x2E        // FIFO control
#define LSM303D_O_FIFO_SRC      0x2F        // FIFO_SRC register
#define LSM303D_O_INT1_CFG      0x30        // INT1 interrupt generation; this
                                            // register only writable after
                                            // boot
#define LSM303D_O_INT1_SRC      0x31        // interrupt source register (read
                                            // only)
#define LSM303D_O_INT1_THS      0x32        // Interrupt 1 threshold
#define LSM303D_O_INT1_DURATION 0x33        // INT1 duration register
#define LSM303D_O_INT2_CFG      0x34        // INT2 interrupt generation; this
                                            // register only writable after
                                            // boot
#define LSM303D_O_INT2_SRC      0x35        // INT2 source register (read only)
#define LSM303D_O_INT2_THS      0x36        // INT2 threshold
#define LSM303D_O_INT2_DURATION 0x37        // INT2 duration register
#define LSM303D_O_CLICK_CFG     0x38        // Click config A register
#define LSM303D_O_CLICK_SRC     0x39        // Click source A
#define LSM303D_O_CLICK_THS     0x3A        // click-click threshold
#define LSM303D_O_TIME_LIMIT    0x3B        // Time Limit A register
#define LSM303D_O_TIME_LATENCY  0x3C        // Time Latency A register; 1 LSB =
                                            // 1/ODR; TLA7 through TLA0 define
                                            // the time interval that starts
                                            // after the first click detection
                                            // where the click detection
                                            // procedure is disabled, in cases
                                            // where the device is configured
                                            // for double click detection
#define LSM303D_O_TIME_WINDOW   0x3D        // Time Window A register; 1 LSB =
                                            // 1/ODR; TW7 through TW0 define
                                            // the maximum interval of time
                                            // that can elapse after the end of
                                            // the latency interval in which
                                            // the click detection procedure
                                            // can start, in cases where the
                                            // device is configured for double
                                            // click detection
#define LSM303D_O_ACT_THS       0x3E        // Sleep to Wake, Return to Sleep
                                            // activation threshold 1LSb = 16mg
#define LSM303D_O_ACT_DUR       0x3F        // Sleep to Wake, Return to Sleep
                                            // duration DUR = (Act_DUR +
                                            // 1)*8/ODR

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_TEMP_OUT_LSB
// register.
//
//*****************************************************************************
#define LSM303D_TEMP_OUT_LSB_LSB_M                                            \
                                0xFF
#define LSM303D_TEMP_OUT_LSB_LSB_S                                            \
                                4

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_TEMP_OUT_MSB
// register.
//
//*****************************************************************************
#define LSM303D_TEMP_OUT_MSB_MSB_M                                            \
                                0x0F
#define LSM303D_TEMP_OUT_MSB_MSB_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_MAG_STATUS
// register.
//
//*****************************************************************************
#define LSM303D_MAG_STATUS_ZYXTMOR_M                                          \
                                0x80        // X,Y,Z axis and temp data overrun
#define LSM303D_MAG_STATUS_ZYXTMOR_TRUE                                       \
                                0x80
#define LSM303D_MAG_STATUS_ZMOR_M                                             \
                                0x40        // Z-axis mag data overrun
#define LSM303D_MAG_STATUS_ZMOR_TRUE                                          \
                                0x40
#define LSM303D_MAG_STATUS_YMOR_M                                             \
                                0x20        // Y-axis mag data overrun
#define LSM303D_MAG_STATUS_YMOR_TRUE                                          \
                                0x20
#define LSM303D_MAG_STATUS_XMOR_M                                             \
                                0x10        // X-axis mag data overrun
#define LSM303D_MAG_STATUS_XMOR_TRUE                                          \
                                0x10
#define LSM303D_MAG_STATUS_ZYXTMD_M                                           \
                                0x08        // X,Y,Z axis and temp data
                                            // available
#define LSM303D_MAG_STATUS_ZYXTMD_AVAIL                                       \
                                0x08
#define LSM303D_MAG_STATUS_ZMD_M                                              \
                                0x04        // New mag data available for Z
                                            // axis
#define LSM303D_MAG_STATUS_ZMD_AVAIL                                          \
                                0x04
#define LSM303D_MAG_STATUS_YMD_M                                              \
                                0x02        // New mag data available for Y
                                            // axis
#define LSM303D_MAG_STATUS_YMD_AVAIL                                          \
                                0x02
#define LSM303D_MAG_STATUS_XMD_M                                              \
                                0x01        // New mag data available for X
                                            // axis
#define LSM303D_MAG_STATUS_XMD_AVAIL                                          \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_MAG_INT_CTRL
// register.
//
//*****************************************************************************
#define LSM303D_MAG_INT_CTRL_XINT_M                                           \
                                0x80        // Enable interrupt recognition on
                                            // X-axis for magnetic data.
#define LSM303D_MAG_INT_CTRL_XINT_ENABLE                                      \
                                0x80
#define LSM303D_MAG_INT_CTRL_YINT_M                                           \
                                0x40        // Enable interrupt recognition on
                                            // Y-axis for magnetic data.
#define LSM303D_MAG_INT_CTRL_YINT_ENABLE                                      \
                                0x40
#define LSM303D_MAG_INT_CTRL_ZINT_M                                           \
                                0x20        // Enable interrupt recognition on
                                            // Z-axis for magnetic data.
#define LSM303D_MAG_INT_CTRL_ZINT_ENABLE                                      \
                                0x20
#define LSM303D_MAG_INT_CTRL_PINCFG_M                                         \
                                0x10        // interrupt pin drive
                                            // configuration
#define LSM303D_MAG_INT_CTRL_PINCFG_PUSHPULL                                  \
                                0x00
#define LSM303D_MAG_INT_CTRL_PINCFG_OPENDRAIN                                 \
                                0x10
#define LSM303D_MAG_INT_CTRL_POLARITY_M                                       \
                                0x08        // interrupt polarity
#define LSM303D_MAG_INT_CTRL_POLARITY_LOW                                     \
                                0x00
#define LSM303D_MAG_INT_CTRL_POLARITY_HIGH                                    \
                                0x08
#define LSM303D_MAG_INT_CTRL_LATCH_M                                          \
                                0x04        // latch interrupt request
#define LSM303D_MAG_INT_CTRL_LATCH_ENABLE                                     \
                                0x04
#define LSM303D_MAG_INT_CTRL_4D_M                                             \
                                0x02        // 4D detection on acceleration
                                            // data is enabled when 6D bit in
                                            // IG_CFG1
#define LSM303D_MAG_INT_CTRL_4D_ENABLE                                        \
                                0x02
#define LSM303D_MAG_INT_CTRL_MI_M                                             \
                                0x01        // Interrupt generation for
                                            // magnetic data
#define LSM303D_MAG_INT_CTRL_MI_ENABLE                                        \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_MAG_INT_SRC
// register.
//
//*****************************************************************************
#define LSM303D_MAG_INT_SRC_M_PTH_X_M                                         \
                                0x80        // Magnetic value on X-axis exceeds
                                            // the threshold on the positive
                                            // side.
#define LSM303D_MAG_INT_SRC_M_PTH_X_ACTIVE                                    \
                                0x80
#define LSM303D_MAG_INT_SRC_M_PTH_Y_M                                         \
                                0x40        // Magnetic value on Y-axis exceeds
                                            // the threshold on the positive
                                            // side.
#define LSM303D_MAG_INT_SRC_M_PTH_Y_ACTIVE                                    \
                                0x40
#define LSM303D_MAG_INT_SRC_M_PTH_Z_M                                         \
                                0x20        // Magnetic value on Z-axis exceeds
                                            // the threshold on the positive
                                            // side.
#define LSM303D_MAG_INT_SRC_M_PTH_Z_ACTIVE                                    \
                                0x20
#define LSM303D_MAG_INT_SRC_M_NTH_X_M                                         \
                                0x10        // Magnetic value on X-axis exceeds
                                            // the threshold on the negative
                                            // side.
#define LSM303D_MAG_INT_SRC_M_NTH_X_ACTIVE                                    \
                                0x10
#define LSM303D_MAG_INT_SRC_M_NTH_Y_M                                         \
                                0x08        // Magnetic value on Y-axis exceeds
                                            // the threshold on the negative
                                            // side.
#define LSM303D_MAG_INT_SRC_M_NTH_Y_ACTIVE                                    \
                                0x08
#define LSM303D_MAG_INT_SRC_M_NTH_Z_M                                         \
                                0x04        // Magnetic value on Z-axis exceeds
                                            // the threshold on the negative
                                            // side.
#define LSM303D_MAG_INT_SRC_M_NTH_Z_ACTIVE                                    \
                                0x04
#define LSM303D_MAG_INT_SRC_MROI_M                                            \
                                0x02        // Internal measurement range
                                            // overflow on magnetic value.
#define LSM303D_MAG_INT_SRC_MROI_ACTIVE                                       \
                                0x02
#define LSM303D_MAG_INT_SRC_MINT_M                                            \
                                0x01        // Magnetic interrupt event. The
                                            // magnetic field value exceeds the
                                            // threshold.
#define LSM303D_MAG_INT_SRC_MINT_ACTIVE                                       \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL0
// register.
//
//*****************************************************************************
#define LSM303D_CTRL0_BOOT_M    0x80        // Reboot memory content.
#define LSM303D_CTRL0_BOOT_REBOOT                                             \
                                0x80
#define LSM303D_CTRL0_FIFO_M    0x40        // FIFO enable.
#define LSM303D_CTRL0_FIFO_ENABLE                                             \
                                0x40
#define LSM303D_CTRL0_FTH_M     0x20        // FIFO programmable threshold
                                            // enable.
#define LSM303D_CTRL0_FTH_ENABLE                                              \
                                0x20
#define LSM303D_CTRL0_HPCLICK_M 0x04        // High-pass filter enabled for
                                            // click function.
#define LSM303D_CTRL0_HPCLICK_ENABLE                                          \
                                0x04
#define LSM303D_CTRL0_HPIS1_M   0x02        // High-pass filter enabled for
                                            // interrupt generator 1
#define LSM303D_CTRL0_HPIS1_ENABLE                                            \
                                0x02
#define LSM303D_CTRL0_HPIS2_M   0x01        // High-pass filter enabled for
                                            // interrupt generator 2
#define LSM303D_CTRL0_HPIS2_ENABLE                                            \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL1
// register.
//
//*****************************************************************************
#define LSM303D_CTRL1_AODR_M    0xF0        // accel output data rate selection
#define LSM303D_CTRL1_AODR_PD   0x00        // Power-down mode
#define LSM303D_CTRL1_AODR_3_125HZ                                            \
                                0x10
#define LSM303D_CTRL1_AODR_6_2HZ                                              \
                                0x20
#define LSM303D_CTRL1_AODR_12_5HZ                                             \
                                0x30
#define LSM303D_CTRL1_AODR_25HZ 0x40
#define LSM303D_CTRL1_AODR_50HZ 0x50
#define LSM303D_CTRL1_AODR_100HZ                                              \
                                0x60
#define LSM303D_CTRL1_AODR_200HZ                                              \
                                0x70
#define LSM303D_CTRL1_AODR_400HZ                                              \
                                0x80
#define LSM303D_CTRL1_AODR_800HZ                                              \
                                0x90
#define LSM303D_CTRL1_AODR_1600HZ                                             \
                                0xA0
#define LSM303D_CTRL1_BDU_M     0x08        // Block data update for
                                            // acceleration and magnetic data.
                                            // (0: continuous update; 1: output
                                            // registers not updated until MSB
                                            // and LSB have been read), default
                                            // continuous
#define LSM303D_CTRL1_BDU_CONTINUOUS                                          \
                                0x00
#define LSM303D_CTRL1_BDU_BLOCK 0x08
#define LSM303D_CTRL1_AXIS_M    0x7         // Axis power control
#define LSM303D_CTRL1_AXIS_Y_EN 0x01        // Y-axis enable
#define LSM303D_CTRL1_AXIS_X_EN 0x02        // X-axis enable
#define LSM303D_CTRL1_AXIS_Z_EN 0x04        // Z-axis enable
#define LSM303D_CTRL1_AODR_S    4
#define LSM303D_CTRL1_AXIS_S    0

