Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_lsm303d.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL2
// register.
//
//*****************************************************************************
#define LSM303D_CTRL2_AFS_M     0x38        // Acceleration full-scale
                                            // selection.
#define LSM303D_CTRL2_AFS_2G    0x00        // +/- 2G sensitivity
#define LSM303D_CTRL2_AFS_4G    0x08        // +/- 4G sensitivity
#define LSM303D_CTRL2_AFS_6G    0x10        // +/- 6G sensitivity
#define LSM303D_CTRL2_AFS_8G    0x18        // +/- 8G sensitivity
#define LSM303D_CTRL2_AFS_16G   0x40        // +/- 16G sensitivity
#define LSM303D_CTRL2_ABW_M     0xC         // anti-alias filter bandwidth
#define LSM303D_CTRL2_ABW_773HZ 0x00
#define LSM303D_CTRL2_ABW_194HZ 0x40
#define LSM303D_CTRL2_ABW_362HZ 0x80
#define LSM303D_CTRL2_ABW_50HZ  0xC0
#define LSM303D_CTRL2_AST_M     0x02        // Acceleration self-test enable.
#define LSM303D_CTRL2_AST_ENABLE                                              \
                                0x02
#define LSM303D_CTRL2_SIM_M     0x01        // SPI Serial Interface mode
                                            // selection. (default: 4 wire)
#define LSM303D_CTRL2_SIM_4WIRE 0x00
#define LSM303D_CTRL2_SIM_3WIRE 0x01
#define LSM303D_CTRL2_ABW_S     6
#define LSM303D_CTRL2_AFS_S     3

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL3
// register.
//
//*****************************************************************************
#define LSM303D_CTRL3_INT1_BOOT_M                                             \
                                0x80        // Boot on INT1 enable
#define LSM303D_CTRL3_INT1_BOOT_EN                                            \
                                0x80
#define LSM303D_CTRL3_INT1_CLICK_M                                            \
                                0x40        // Click generator interrupt on
                                            // INT1.
#define LSM303D_CTRL3_INT1_CLICK_EN                                           \
                                0x40
#define LSM303D_CTRL3_INT1_IG1_M                                              \
                                0x20        // Inertial interrupt generator 1
                                            // on INT1
#define LSM303D_CTRL3_INT1_IG1_EN                                             \
                                0x20
#define LSM303D_CTRL3_INT1_IG2_M                                              \
                                0x10        // Inertial interrupt generator 2
                                            // on INT1
#define LSM303D_CTRL3_INT1_IG2_EN                                             \
                                0x10
#define LSM303D_CTRL3_INT1_IGM_M                                              \
                                0x08        // Magnetic interrupt generator on
                                            // INT1
#define LSM303D_CTRL3_INT1_IGM_EN                                             \
                                0x08
#define LSM303D_CTRL3_INT1_ACCEL_DRDY_M                                       \
                                0x04        // Accelerometer data-ready signal
                                            // on INT1
#define LSM303D_CTRL3_INT1_ACCEL_DRDY_EN                                      \
                                0x04
#define LSM303D_CTRL3_INT1_MAG_DRDY_M                                         \
                                0x02        // Magnetometer data-ready signal
                                            // on INT1.
#define LSM303D_CTRL3_INT1_MAG_DRDY_EN                                        \
                                0x02
#define LSM303D_CTRL3_INT1_EMPTY_M                                            \
                                0x01        // FIFO empty indication on INT1
#define LSM303D_CTRL3_INT1_EMPTY_EN                                           \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL4
// register.
//
//*****************************************************************************
#define LSM303D_CTRL4_INT2_CLICK_M                                            \
                                0x80        // Click generator interrupt on
                                            // INT2
#define LSM303D_CTRL4_INT2_CLICK_EN                                           \
                                0x80
#define LSM303D_CTRL4_INT2_IG1_M                                              \
                                0x40        // Inertial interrupt generator 1
                                            // on INT2
#define LSM303D_CTRL4_INT2_IG1_EN                                             \
                                0x40
#define LSM303D_CTRL4_INT2_IG2_M                                              \
                                0x20        // Inertial interrupt generator 2
                                            // on INT2
#define LSM303D_CTRL4_INT2_IG2_EN                                             \
                                0x20
#define LSM303D_CTRL4_INT2_IGM_M                                              \
                                0x10        // Magnetic interrupt generator on
                                            // INT2
#define LSM303D_CTRL4_INT2_IGM_EN                                             \
                                0x10
#define LSM303D_CTRL4_INT2_ACCEL_DRDY_M                                       \
                                0x08        // Accelerometer data-ready signal
                                            // on INT2
#define LSM303D_CTRL4_INT2_ACCEL_DRDY_EN                                      \
                                0x08
#define LSM303D_CTRL4_INT2_MAG_DRDY_M                                         \
                                0x04        // Magnetometer data-ready signal
                                            // on INT2
#define LSM303D_CTRL4_INT2_MAG_DRDY_EN                                        \
                                0x04
#define LSM303D_CTRL4_INT2_OVR_M                                              \
                                0x02        // FIFO overrun interrupt on INT2
#define LSM303D_CTRL4_INT2_OVR_EN                                             \
                                0x02
#define LSM303D_CTRL4_INT2_FTH_M                                              \
                                0x01        // FIFO threshold interrupt on INT2
#define LSM303D_CTRL4_INT2_FTH_EN                                             \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL5
// register.
//
//*****************************************************************************
#define LSM303D_CTRL5_TEMP_M    0x80        // Temperature sensor enable.
#define LSM303D_CTRL5_TEMP_EN   0x80
#define LSM303D_CTRL5_MRES_M    0x60        // Magnetic resolution selection
#define LSM303D_CTRL5_MRES_LOW  0x00        // low resolution
#define LSM303D_CTRL5_MRES_HIGH 0x60        // high resolution
#define LSM303D_CTRL5_MODR_M    0x1C        // mag output data rate selection
#define LSM303D_CTRL5_MODR_3_125HZ                                            \
                                0x00
#define LSM303D_CTRL5_MODR_6_2HZ                                              \
                                0x04
#define LSM303D_CTRL5_MODR_12_5HZ                                             \
                                0x08
#define LSM303D_CTRL5_MODR_25HZ 0x0C
#define LSM303D_CTRL5_MODR_50HZ 0x10
#define LSM303D_CTRL5_MODR_100HZ                                              \
                                0x14
#define LSM303D_CTRL5_LIR2_M    0x02        // latch interrupt request on int2
#define LSM303D_CTRL5_LIR2_EN   0x02
#define LSM303D_CTRL5_LIR1_M    0x01        // latch interrupt request on int1
#define LSM303D_CTRL5_LIR1_EN   0x01
#define LSM303D_CTRL5_MRES_S    5
#define LSM303D_CTRL5_MODR_S    2

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL6
// register.
//
//*****************************************************************************
#define LSM303D_CTRL6_MFS_M     0x60        // magnetic full scale select
#define LSM303D_CTRL6_MFS_2G    0x00        // +/- 2 gauss
#define LSM303D_CTRL6_MFS_4G    0x20        // +/- 4 gauss
#define LSM303D_CTRL6_MFS_8G    0x40        // +/- 8 gauss
#define LSM303D_CTRL6_MFS_12G   0x60        // +/- 16 gauss
#define LSM303D_CTRL6_MFS_S     5

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CTRL7
// register.
//
//*****************************************************************************
#define LSM303D_CTRL7_AHPM_M    0xC0        // High-pass filter mode selection
                                            // for acceleration data
#define LSM303D_CTRL7_AHPM_NORMAL                                             \
                                0x00
#define LSM303D_CTRL7_AHPM_REFERENCE                                          \
                                0x40
#define LSM303D_CTRL7_AHPM_AUTORESET                                          \
                                0xC0
#define LSM303D_CTRL7_AFDS_M    0x20        // default: internal filter
                                            // bypassed
#define LSM303D_CTRL7_AFDS_BYPASSED                                           \
                                0x00
#define LSM303D_CTRL7_AFDS_FILTERED                                           \
                                0x20
#define LSM303D_CTRL7_TEMP_ONLY_M                                             \
                                0x10        // Temperature sensor only mode,
                                            // mag off
#define LSM303D_CTRL7_TEMP_ONLY_EN                                            \
                                0x10
#define LSM303D_CTRL7_MLP_M     0x04        // Magnetic data low-power mode. If
                                            // this bit is 1, the M_ODR [2:0]
                                            // is set to 3.125 Hz independently
                                            // from the MODR settings.
#define LSM303D_CTRL7_MLP_NORMAL                                              \
                                0x00
#define LSM303D_CTRL7_MLP_LOWPOWER                                            \
                                0x04
#define LSM303D_CTRL7_MD_M      0x3         // Magnetic sensor mode selection
#define LSM303D_CTRL7_MD_CONTINUOUS                                           \
                                0x00
#define LSM303D_CTRL7_MD_SINGLE 0x01
#define LSM303D_CTRL7_MD_POWERDOWN                                            \
                                0x02
#define LSM303D_CTRL7_AHPM_S    6
#define LSM303D_CTRL7_MD_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_STATUS
// register.
//
//*****************************************************************************
#define LSM303D_STATUS_OR_M     0xF0        // Accel Axis data overrun
#define LSM303D_STATUS_OR_X     0x10        // Accel X-axis data overrun
#define LSM303D_STATUS_OR_Y     0x20        // Accel Y-axis data overrun
#define LSM303D_STATUS_OR_Z     0x40        // Accel Z-axis data overrun
#define LSM303D_STATUS_OR_ZYX   0x80        // Accel X, Y, and X data overrun
#define LSM303D_STATUS_DA_M     0xF         // Accel data available
#define LSM303D_STATUS_DA_X     0x01        // Accel X-axis data available
#define LSM303D_STATUS_DA_Y     0x02        // Accel Y-axis data available
#define LSM303D_STATUS_DA_Z     0x04        // Accel Z-axis data available
#define LSM303D_STATUS_DA_ZYX   0x08        // Accel X, Y, and X data available
#define LSM303D_STATUS_OR_S     4
#define LSM303D_STATUS_DA_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_FIFO_CTRL
// register.
//
//*****************************************************************************
#define LSM303D_FIFO_CTRL_MODE_M                                              \
                                0xE0        // FIFO mode setting
#define LSM303D_FIFO_CTRL_MODE_BYPASS                                         \
                                0x00        // Bypass mode
#define LSM303D_FIFO_CTRL_MODE_FIFO                                           \
                                0x20        // FIFO mode
#define LSM303D_FIFO_CTRL_MODE_STREAM                                         \
                                0x40        // Stream mode
#define LSM303D_FIFO_CTRL_MODE_S2F                                            \
                                0x60        // Stream-to-FIFO mode
#define LSM303D_FIFO_CTRL_MODE_B2S                                            \
                                0x80        // Bypass-to-stream mode
#define LSM303D_FIFO_CTRL_THRESH_M                                            \
                                0x1F        // FIFO Threshold setting
#define LSM303D_FIFO_CTRL_MODE_S                                              \
                                5
#define LSM303D_FIFO_CTRL_THRESH_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_FIFO_SRC
// register.
//
//*****************************************************************************
#define LSM303D_FIFO_SRC_FTH_M  0x80        // FIFO threshold is greater than
                                            // or equal to level or less than
                                            // level
#define LSM303D_FIFO_SRC_FTH_LT 0x00
#define LSM303D_FIFO_SRC_FTH_GEQ                                              \
                                0x80
#define LSM303D_FIFO_SRC_OVRN_M 0x40        // overrun status bit
#define LSM303D_FIFO_SRC_OVRN_FILLED                                          \
                                0x40
#define LSM303D_FIFO_SRC_EMPTY_M                                              \
                                0x20        // FIFO empty
#define LSM303D_FIFO_SRC_EMPTY_EMPTY                                          \
                                0x20
#define LSM303D_FIFO_SRC_STORE_SAMPLES_M                                      \
                                0x1F        // FIFO stored data level of the
                                            // unread samples
#define LSM303D_FIFO_SRC_STORE_SAMPLES_S                                      \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT1_CFG
// register.
//
//*****************************************************************************
#define LSM303D_INT1_CFG_ANDOR_M                                              \
                                0x80        // AND/OR combination of Interrupt
                                            // events; default value: 0
#define LSM303D_INT1_CFG_ANDOR_OR                                             \
                                0x00
#define LSM303D_INT1_CFG_ANDOR_AND                                            \
                                0x80
#define LSM303D_INT1_CFG_6D_M   0x40        // 6-direction function enabled
#define LSM303D_INT1_CFG_6D_EN  0x40
#define LSM303D_INT1_CFG_ZHI_M  0x20        // enable interrupt generation on
                                            // Z-hi event
#define LSM303D_INT1_CFG_ZHI_EN 0x20
#define LSM303D_INT1_CFG_ZUPE_M 0x20        // enable interrupt generation on
                                            // Z-hi event
#define LSM303D_INT1_CFG_ZUPE_EN                                              \
                                0x20
#define LSM303D_INT1_CFG_ZDOWNE_M                                             \
                                0x10        // enable interrupt generation on
                                            // Z-low event
#define LSM303D_INT1_CFG_ZDOWNE_EN                                            \
                                0x10
#define LSM303D_INT1_CFG_ZLI_M  0x10        // enable interrupt generation on
                                            // Z-low event
#define LSM303D_INT1_CFG_ZLI_EN 0x10
#define LSM303D_INT1_CFG_YUPE_M 0x08        // enable interrupt generation on
                                            // Y-hi event
#define LSM303D_INT1_CFG_YUPE_EN                                              \
                                0x08
#define LSM303D_INT1_CFG_YHI_M  0x08        // enable interrupt generation on
                                            // Y-hi event
#define LSM303D_INT1_CFG_YHI_EN 0x08
#define LSM303D_INT1_CFG_YDOWNE_M                                             \
                                0x04        // enable interrupt generation on
                                            // Y-low event
#define LSM303D_INT1_CFG_YDOWNE_EN                                            \
                                0x04
#define LSM303D_INT1_CFG_YLI_M  0x04        // enable interrupt generation on
                                            // Y-low event
#define LSM303D_INT1_CFG_YLI_EN 0x04
#define LSM303D_INT1_CFG_XUPE_M 0x02        // enable interrupt generation on
                                            // X-hi event
#define LSM303D_INT1_CFG_XUPE_EN                                              \
                                0x02
#define LSM303D_INT1_CFG_XHI_M  0x02        // enable interrupt generation on
                                            // X-hi event
#define LSM303D_INT1_CFG_XHI_EN 0x02
#define LSM303D_INT1_CFG_XDOWNE_M                                             \
                                0x01        // enable interrupt generation on
                                            // X-low event
#define LSM303D_INT1_CFG_XDOWNE_EN                                            \
                                0x01
#define LSM303D_INT1_CFG_XLI_M  0x01        // enable interrupt generation on
                                            // X-low event
#define LSM303D_INT1_CFG_XLI_EN 0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT1_SRC
// register.
//
//*****************************************************************************
#define LSM303D_INT1_SRC_ZERO_M 0x80        // This bit must be zero
#define LSM303D_INT1_SRC_ZERO_ZERO                                            \
                                0x00
#define LSM303D_INT1_SRC_ZERO_INVALID                                         \
                                0x80
#define LSM303D_INT1_SRC_IA_M   0x40        // interrupt active
#define LSM303D_INT1_SRC_IA_ACTIVE                                            \
                                0x40
#define LSM303D_INT1_SRC_ZH_M   0x20        // Z-Hi event occurred
#define LSM303D_INT1_SRC_ZH_OCCURRED                                          \
                                0x20
#define LSM303D_INT1_SRC_ZL_M   0x10        // Z-Low event occurred
#define LSM303D_INT1_SRC_ZL_OCCURRED                                          \
                                0x10
#define LSM303D_INT1_SRC_YH_M   0x08        // Y-Hi event occurred
#define LSM303D_INT1_SRC_YH_OCCURRED                                          \
                                0x08
#define LSM303D_INT1_SRC_YL_M   0x04        // Y-Low event occurred
#define LSM303D_INT1_SRC_YL_OCCURRED                                          \
                                0x04
#define LSM303D_INT1_SRC_XH_M   0x02        // X-Hi event occurred
#define LSM303D_INT1_SRC_XH_OCCURRED                                          \
                                0x02
#define LSM303D_INT1_SRC_XL_M   0x01        // X-Low event occurred
#define LSM303D_INT1_SRC_XL_OCCURRED                                          \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT1_THS
// register.
//
//*****************************************************************************
#define LSM303D_INT1_THS_ZERO_M 0x80        // This bit must be zero
#define LSM303D_INT1_THS_ZERO_ZERO                                            \
                                0x00
#define LSM303D_INT1_THS_ZERO_INVALID                                         \
                                0x80
#define LSM303D_INT1_THS_THS_M  0x7F        // THS[6-0] Interrupt threshold,
                                            // default 0x0
#define LSM303D_INT1_THS_THS_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT1_DURATION
// register.
//
//*****************************************************************************
#define LSM303D_INT1_DURATION_ZERO_M                                          \
                                0x80        // This bit must be zero
#define LSM303D_INT1_DURATION_ZERO_ZERO                                       \
                                0x00
#define LSM303D_INT1_DURATION_ZERO_INVALID                                    \
                                0x80
#define LSM303D_INT1_DURATION_DURATION_M                                      \
                                0x7F        // Duration D[6-0]
#define LSM303D_INT1_DURATION_DURATION_S                                      \
                                0

